laba12/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "tetovske@yandex.ru"], ["password", "123456"], ["created_at", "2020-01-12 15:06:36.975146"], ["updated_at", "2020-01-12 15:06:36.975146"]]
---
  def create
    @user = User.new(user_params)
    @user.password = Digest::SHA256.hexdigest(@user.password)

    if @user.save

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "1234"], ["updated_at", "2020-01-12 15:11:57.687610"], ["id", 2]]
---
  def update
    if @user.update(user_params)