laba12/app/models/calculation.rb

SELECT "calculations".* FROM "calculations" WHERE "calculations"."request" = ? LIMIT ?  [["request", "5"], ["LIMIT", 1]]
---
    def find_response(data)
      return if Calculation.find_by(request: data).nil?

      JSON.parse(Calculation.find_by(request: data).response)

INSERT INTO "calculations" ("request", "response", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["request", "5"], ["response", "[54748,92727,93084]"], ["created_at", "2020-01-12 14:10:35.468845"], ["updated_at", "2020-01-12 14:10:35.468845"]]
---
    def add_response(req, res)
      parsed = res.to_json
      record = Calculation.create(request: req, response: parsed)

SELECT "calculations".* FROM "calculations"
---
    def parse_db
      Calculation.all.map { |rec| [rec.request, rec.response] }